FACT_TOPICS = [
    "космос",
    "тварини",
    "людське тіло",
    "історія",
    "техніка та винаходи",
    "мови та слова",
    "їжа",
    "океани",
    "рослини",
    "спорт",
    "мистецтво",
    "фізика",
]


QUIZ_TOPICS = {
    "geo": "Географія",
    "history": "Історія",
    "science": "Наука",
    "movies": "Кіно",
}


PERSONS = {
    "cobain": "Курт Кобейн",
    "queen": "Єлизавета II",
    "tolkien": "Джон Толкін",
    "nietzsche": "Фрідріх Ніцше",
    "hawking": "Стівен Гокінг",
}

LANGUAGES = {
    "en": "Англійська",
    "de": "Німецька",
    "pl": "Польська",
    "es": "Іспанська",
    "uk": "Українська",
}


RECOMMEND_CATEGORIES = {
    "movies": "Фільми",
    "books": "Книги",
    "music": "Музика",
}

FALLBACK = "😔 Не вдалося звʼязатися з ChatGPT. Спробуй ще раз за хвилину."
